import pytest
import pandas as pd


@pytest.fixture
def mock_excel_dict_fixt():
    return [
        {"Дата операции": "31.12.2021 16:44:00", "Дата платежа": "31.12.2021", "Номер карты": "*7197", "Статус": "OK"}
    ]


@pytest.fixture
def fixt_card_result():
    return [
        {"last_digits": "*5091", "total_spent": 1.51, "cashback": 0.02},
        {"last_digits": "*7197", "total_spent": 3400.0, "cashback": 34.0},
    ]


@pytest.fixture
def fixt_test_df():
    return pd.DataFrame(
        {
            "Дата операции": [
                "25.12.2021 13:04:15",
                "24.12.2021 15:44:07",
                "23.12.2021 22:33:11",
                "23.12.2021 16:45:12",
                "14.11.2021 14:46:24",
            ],
            "Дата платежа": ["25.12.2021", "24.12.2021", "23.12.2021", "23.12.2021", "14.11.2021"],
            "Номер карты": ["*7197", 0, "*5091", "*4556", "*4556"],
            "Статус": ["OK", "OK", "OK", "OK", "FAILED"],
            "Сумма платежа": [-3400.00, -2000.00, -1.51, 20000.00, -55.00],
            "Категория": ["a", "b", "c", "d", "e"],
            "Описание": ["aa", "bb", "cc", "dd", "ee"],
        }
    )


@pytest.fixture
def fixt_test_df_dict():
    return [
        {
            "Дата операции": "25.12.2021 13:04:15",
            "Дата платежа": "25.12.2021",
            "Категория": "a",
            "Номер карты": "*7197",
            "Описание": "aa",
            "Статус": "OK",
            "Сумма платежа": -3400.0,
        },
        {
            "Дата операции": "24.12.2021 15:44:07",
            "Дата платежа": "24.12.2021",
            "Категория": "b",
            "Номер карты": 0,
            "Описание": "bb",
            "Статус": "OK",
            "Сумма платежа": -2000.0,
        },
        {
            "Дата операции": "23.12.2021 22:33:11",
            "Дата платежа": "23.12.2021",
            "Категория": "c",
            "Номер карты": "*5091",
            "Описание": "cc",
            "Статус": "OK",
            "Сумма платежа": -1.51,
        },
        {
            "Дата операции": "23.12.2021 16:45:12",
            "Дата платежа": "23.12.2021",
            "Категория": "d",
            "Номер карты": "*4556",
            "Описание": "dd",
            "Статус": "OK",
            "Сумма платежа": 20000.0,
        },
    ]


@pytest.fixture
def fixt_top_5_results():
    return [
        {"amount": 20000.0, "category": "d", "date": "23.12.2021", "description": "dd"},
        {"amount": -1.51, "category": "c", "date": "23.12.2021", "description": "cc"},
        {"amount": -55.0, "category": "e", "date": "14.11.2021", "description": "ee"},
        {"amount": -2000.0, "category": "b", "date": "24.12.2021", "description": "bb"},
        {"amount": -3400.0, "category": "a", "date": "25.12.2021", "description": "aa"},
    ]


@pytest.fixture
def api_stocks_response():
    return {
        "pagination": {"limit": 100, "offset": 0, "count": 5, "total": 5},
        "data": [
            {
                "open": 219.805,
                "high": 223.49,
                "low": 218.9,
                "close": 223.19,
                "volume": 36361327.0,
                "adj_high": 223.68,
                "adj_low": 218.9,
                "adj_close": 223.19,
                "adj_open": 219.805,
                "adj_volume": 36412740.0,
                "split_factor": 1.0,
                "dividend": 0.0,
                "symbol": "AAPL",
                "exchange": "XNAS",
                "date": "2025-04-01T00:00:00+0000",
            },
            {
                "open": 187.86,
                "high": 193.93,
                "low": 187.2,
                "close": 192.17,
                "volume": 41267315.0,
                "adj_high": 193.93,
                "adj_low": 187.2,
                "adj_close": 192.17,
                "adj_open": 187.86,
                "adj_volume": 41267315.0,
                "split_factor": 1.0,
                "dividend": 0.0,
                "symbol": "AMZN",
                "exchange": "XNAS",
                "date": "2025-04-01T00:00:00+0000",
            },
            {
                "open": 153.62,
                "high": 158.1,
                "low": 153.62,
                "close": 157.07,
                "volume": 30672899.0,
                "adj_high": 158.1,
                "adj_low": 153.62,
                "adj_close": 157.07,
                "adj_open": 153.62,
                "adj_volume": 30601490.0,
                "split_factor": 1.0,
                "dividend": 0.0,
                "symbol": "GOOGL",
                "exchange": "XNAS",
                "date": "2025-04-01T00:00:00+0000",
            },
            {
                "open": 374.655,
                "high": 382.85,
                "low": 373.23,
                "close": 382.19,
                "volume": 19431057.0,
                "adj_high": 382.85,
                "adj_low": 373.23,
                "adj_close": 382.19,
                "adj_open": 374.65,
                "adj_volume": 19689503.0,
                "split_factor": 1.0,
                "dividend": 0.0,
                "symbol": "MSFT",
                "exchange": "XNAS",
                "date": "2025-04-01T00:00:00+0000",
            },
            {
                "open": 263.8,
                "high": 277.45,
                "low": 259.25,
                "close": 268.46,
                "volume": 146486911.0,
                "adj_high": 277.45,
                "adj_low": 259.25,
                "adj_close": 268.46,
                "adj_open": 263.8,
                "adj_volume": 143339801.0,
                "split_factor": 1.0,
                "dividend": 0.0,
                "symbol": "TSLA",
                "exchange": "XNAS",
                "date": "2025-04-01T00:00:00+0000",
            },
        ],
    }


@pytest.fixture
def get_stocks_mock_result():
    return [
        {"price": 223.19, "stock": "AAPL"},
        {"price": 192.17, "stock": "AMZN"},
        {"price": 157.07, "stock": "GOOGL"},
        {"price": 382.19, "stock": "MSFT"},
        {"price": 268.46, "stock": "TSLA"},
    ]


@pytest.fixture
def mock_result_trsnf_people():
    return (
        "[\n"
        "    {\n"
        '        "Дата операции": "25.12.2021 13:04:15",\n'
        '        "Дата платежа": "25.12.2021",\n'
        '        "Номер карты": "*7197",\n'
        '        "Статус": "OK",\n'
        '        "Сумма платежа": -3400.0,\n'
        '        "Категория": "Переводы",\n'
        '        "Описание": "Константин Л."\n'
        "    },\n"
        "    {\n"
        '        "Дата операции": "24.12.2021 15:44:07",\n'
        '        "Дата платежа": "24.12.2021",\n'
        '        "Номер карты": 0,\n'
        '        "Статус": "OK",\n'
        '        "Сумма платежа": -2000.0,\n'
        '        "Категория": "Переводы",\n'
        '        "Описание": "Константин Л."\n'
        "    }\n"
        "]"
    )


@pytest.fixture
def fixt_test_df_2():
    return pd.DataFrame(
        {
            "Дата операции": [
                "25.12.2021 13:04:15",
                "24.12.2021 15:44:07",
                "23.12.2021 22:33:11",
                "23.12.2021 16:45:12",
                "14.11.2021 14:46:24",
                "15.11.2021 16:45:12",
            ],
            "Дата платежа": ["25.12.2021", "24.12.2021", "23.12.2021", "23.12.2021", "14.11.2021", "15.11.2021"],
            "Номер карты": ["*7197", 0, "*5091", "*4556", "*4556", "*4556"],
            "Статус": ["OK", "OK", "OK", "OK", "FAILED", "OK"],
            "Сумма платежа": [-3400.00, -2000.00, -1.51, 20000.00, -55.00, -1500.00],
            "Категория": ["Переводы", "Переводы", "Супермаркеты", "Пополнения", "Переводы", "Переводы"],
            "Описание": [
                "Константин Л.",
                "Константин Л.",
                "Колхоз",
                "Пополнение через Газпромбанк",
                "Перевод на карту",
                "Перевод Кредитная карта. ТП 10.2 RUR",
            ],
        }
    )
