import pytest
import pandas as pd


@pytest.fixture
def mock_excel_dict_fixt():
    return [{'Дата операции': '31.12.2021 16:44:00',
             'Дата платежа': '31.12.2021',
             'Номер карты': '*7197',
             'Статус': 'OK'}]


@pytest.fixture
def fixt_card_result():
    return [{'last_digits': '*5091', 'total_spent': 1.51, 'cashback': 0.02},
            {'last_digits': '*7197', 'total_spent': 3400.0, 'cashback': 34.0}]


@pytest.fixture
def fixt_test_df():
    return pd.DataFrame({"Дата операции": ["25.12.2021 13:04:15",
                                           "24.12.2021 15:44:07",
                                           "23.12.2021 22:33:11",
                                           "23.12.2021 16:45:12",
                                           "14.11.2021 14:46:24"],
                         "Дата платежа":["25.12.2021","24.12.2021","23.12.2021","23.12.2021","14.11.2021"],
                         "Номер карты": ["*7197", 0, "*5091", "*4556", "*4556"],
                         "Статус": ["OK", "OK", "OK", "OK", "FAILED"],
                         "Сумма платежа": [-3400.00, -2000.00, -1.51, 20000.00, -55.00],
                         "Категория":["a","b","c","d","e"],
                         "Описание":["aa","bb","cc","dd","ee"]})


@pytest.fixture
def fixt_test_df_dict():
    return [{'Дата операции': '25.12.2021 13:04:15',
  'Дата платежа': '25.12.2021',
  'Категория': 'a',
  'Номер карты': '*7197',
  'Описание': 'aa',
  'Статус': 'OK',
  'Сумма платежа': -3400.0},
 {'Дата операции': '24.12.2021 15:44:07',
  'Дата платежа': '24.12.2021',
  'Категория': 'b',
  'Номер карты': 0,
  'Описание': 'bb',
  'Статус': 'OK',
  'Сумма платежа': -2000.0},
 {'Дата операции': '23.12.2021 22:33:11',
  'Дата платежа': '23.12.2021',
  'Категория': 'c',
  'Номер карты': '*5091',
  'Описание': 'cc',
  'Статус': 'OK',
  'Сумма платежа': -1.51},
 {'Дата операции': '23.12.2021 16:45:12',
  'Дата платежа': '23.12.2021',
  'Категория': 'd',
  'Номер карты': '*4556',
  'Описание': 'dd',
  'Статус': 'OK',
  'Сумма платежа': 20000.0}]

@pytest.fixture
def fixt_top_5_results():
    return [{'amount': 20000.0,
  'category': 'd',
  'date': '23.12.2021',
  'description': 'dd'},
 {'amount': -1.51, 'category': 'c', 'date': '23.12.2021', 'description': 'cc'},
 {'amount': -55.0, 'category': 'e', 'date': '14.11.2021', 'description': 'ee'},
 {'amount': -2000.0,
  'category': 'b',
  'date': '24.12.2021',
  'description': 'bb'},
 {'amount': -3400.0,
  'category': 'a',
  'date': '25.12.2021',
  'description': 'aa'}]